# Iris

### Introduction:

This exercise may seem a little bit strange, but keep doing it.

### Step 1. Import the necessary libraries

In [23]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data).

### Step 3. Assign it to a variable called iris

In [11]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
iris = pd.read_csv(url, header=None)
iris.sample(5)

       0    1    2    3                4
75   6.6  3.0  4.4  1.4  Iris-versicolor
62   6.0  2.2  4.0  1.0  Iris-versicolor
58   6.6  2.9  4.6  1.3  Iris-versicolor
16   5.4  3.9  1.3  0.4      Iris-setosa
103  6.3  2.9  5.6  1.8   Iris-virginica

### Step 4. Create columns for the dataset

In [20]:
# 1. sepal_length (in cm)
# 2. sepal_width (in cm)
# 3. petal_length (in cm)
# 4. petal_width (in cm)
# 5. class

old_names = iris.columns.values
new_names =['sepal_length (in cm)', 'sepal_width (in cm)',
            'petal_length (in cm)', 'petal_width (in cm)', 'class']

iris.rename(columns=dict(zip(old_names, new_names)), inplace=True)
iris.head(3)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa

### Step 5.  Is there any missing value in the dataframe?

In [21]:
iris.isna().sum().sum()

0

### Step 6.  Lets set the values of the rows 10 to 29 of the column 'petal_length' to NaN

In [26]:
iris.loc[10:29, 'petal_length (in cm)'] = np.nan

### Step 7. Good, now lets substitute the NaN values to 1.0

In [28]:
iris.fillna(value=1, inplace=True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa

### Step 8. Now let's delete the column class

In [30]:
iris.drop(columns='class', inplace=True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,5.1,3.5,1.4,0.2
1,4.9,3.0,1.4,0.2
2,4.7,3.2,1.3,0.2
3,4.6,3.1,1.5,0.2
4,5.0,3.6,1.4,0.2

### Step 9.  Set the first 3 rows as NaN

In [33]:
iris.iloc[0:2]=np.nan
iris.head(6)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN
4,5.0,3.6,1.4,0.2
5,5.4,3.9,1.7,0.4

### Step 10.  Delete the rows that have NaN

In [35]:
iris.dropna(how='any', axis='rows', inplace=True)
iris.head(6)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
4,5.0,3.6,1.4,0.2
5,5.4,3.9,1.7,0.4
6,4.6,3.4,1.4,0.3
7,5.0,3.4,1.5,0.2
8,4.4,2.9,1.4,0.2
9,4.9,3.1,1.0,0.1

### Step 11. Reset the index so it begins with 0 again

In [37]:
iris.reset_index(drop=True, inplace=True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,5.0,3.6,1.4,0.2
1,5.4,3.9,1.7,0.4
2,4.6,3.4,1.4,0.3
3,5.0,3.4,1.5,0.2
4,4.4,2.9,1.4,0.2

### BONUS: Create your own question and answer it.